
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖Success! The configuration is valid.


#### Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.vpc-configuration.data.aws_availability_zones.available: Refreshing state... [id=eu-west-1]
module.eks.data.aws_caller_identity.current: Refreshing state...
module.eks.data.aws_ami.eks_worker: Refreshing state...
module.eks.data.aws_iam_policy_document.cluster_elb_sl_role_creation[0]: Refreshing state...
module.eks.data.aws_iam_policy_document.cluster_assume_role_policy: Refreshing state...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-04a5b323b7b162cb7]
module.eks.data.aws_ami.eks_worker_windows: Refreshing state...
module.eks.data.aws_partition.current: Refreshing state...
module.eks.data.aws_iam_policy_document.workers_assume_role_policy: Refreshing state...
module.vpc-configuration.data.null_data_source.private_subnets[0]: Refreshing state... [id=static]
module.vpc-configuration.data.null_data_source.public_subnets[0]: Refreshing state... [id=static]
module.vpc-configuration.data.null_data_source.public_subnets[1]: Refreshing state... [id=static]
module.vpc-configuration.data.null_data_source.private_subnets[2]: Refreshing state... [id=static]
module.vpc-configuration.data.null_data_source.private_subnets[1]: Refreshing state... [id=static]
module.vpc-configuration.data.null_data_source.public_subnets[2]: Refreshing state... [id=static]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-00b7e014ef94fcb85]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-079eda0735b8b1c16]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0c5405a2a6e7b22a4]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-04ef5d5afaec9e1cd]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0a585e354decfc46a]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0f1bb88d5774fefe3]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ceb2435a0e0b6a3a]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0c2ec0fe8c82dd991]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-04a1a3206be60a72b]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0e54618954bef6ac8]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-01d8ca1ca0683beb6]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0050d27e0c1a421ce]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0e3878cbbe62e3719]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0e896a0c20d2430f8]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-04ef5d5afaec9e1cd1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0b47a8c678e139686]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-051704a316526b9f6]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-00fd283818b47ca49]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-01933ef5e62103405]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-09bac3e3bd9d1cd7f]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0d546180c3fa3ce7c]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-00c3b96375938a21c]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-030bf43631e108e6a]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-07811f5e914633db3]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-0e54618954bef6ac81080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0e896a0c20d2430f81080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0050d27e0c1a421ce1080289494]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_security_group.all_worker_mgmt will be created
  + resource "aws_security_group" "all_worker_mgmt" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                  + "172.16.0.0/12",
                  + "192.168.0.0/16",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "all_worker_management"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = "vpc-04a5b323b7b162cb7"
    }

  # module.eks.data.template_file.userdata[0] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "userdata"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            #!/bin/bash -xe
            
            # Allow user supplied pre userdata code
            ${pre_userdata}
            
            # Bootstrap and join the cluster
            /etc/eks/bootstrap.sh --b64-cluster-ca '${cluster_auth_base64}' --apiserver-endpoint '${endpoint}' ${bootstrap_extra_args} --kubelet-extra-args "${kubelet_extra_args}" '${cluster_name}'
            
            # Allow user supplied userdata code
            ${additional_userdata}
        EOT
      + vars     = {
          + "additional_userdata"  = ""
          + "bootstrap_extra_args" = ""
          + "cluster_auth_base64"  = (known after apply)
          + "cluster_name"         = "iac-revenite-dev"
          + "endpoint"             = (known after apply)
          + "kubelet_extra_args"   = ""
          + "platform"             = "linux"
          + "pre_userdata"         = ""
        }
    }

  # module.eks.aws_autoscaling_group.workers[0] will be created
  + resource "aws_autoscaling_group" "workers" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 2
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + max_instance_lifetime     = 0
      + max_size                  = 3
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "iac-revenite-dev-worker-group-1"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + suspended_processes       = [
          + "AZRebalance",
        ]
      + termination_policies      = []
      + vpc_zone_identifier       = [
          + "subnet-01d8ca1ca0683beb6",
          + "subnet-0ceb2435a0e0b6a3a",
          + "subnet-0e3878cbbe62e3719",
        ]
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "iac-revenite-dev-worker-group-1-eks_asg"
        }
      + tag {
          + key                 = "k8s.io/cluster/iac-revenite-dev"
          + propagate_at_launch = true
          + value               = "owned"
        }
      + tag {
          + key                 = "kubernetes.io/cluster/iac-revenite-dev"
          + propagate_at_launch = true
          + value               = "owned"
        }
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "iac-revenite-dev"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + version               = "1.17"

      + kubernetes_network_config {
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "15m"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-01d8ca1ca0683beb6",
              + "subnet-0ceb2435a0e0b6a3a",
              + "subnet-0e3878cbbe62e3719",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_instance_profile.workers[0] will be created
  + resource "aws_iam_instance_profile" "workers" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "iac-revenite-dev"
      + path        = "/"
      + role        = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
      + arn         = (known after apply)
      + description = "Permissions for EKS to create AWSServiceRoleForElasticLoadBalancing service-linked role"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "iac-revenite-dev-elb-sl-role-creation"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeAccountAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.eks.aws_iam_role.cluster[0] will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "iac-revenite-dev"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.workers[0] will be created
  + resource "aws_iam_role" "workers" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSWorkerAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "iac-revenite-dev"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceControllerPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_elb_sl_role_creation" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.aws_launch_configuration.workers[0] will be created
  + resource "aws_launch_configuration" "workers" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = false
      + enable_monitoring           = true
      + iam_instance_profile        = (known after apply)
      + id                          = (known after apply)
      + image_id                    = "ami-09e27bb6e561e4a40"
      + instance_type               = "t2.medium"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + name_prefix                 = "iac-revenite-dev-worker-group-1"
      + security_groups             = (known after apply)
      + user_data_base64            = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + encrypted             = false
          + iops                  = 0
          + volume_size           = 100
          + volume_type           = "gp2"
        }
    }

  # module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "iac-revenite-dev"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "iac-revenite-dev-eks_cluster_sg"
        }
      + vpc_id                 = "vpc-04a5b323b7b162cb7"
    }

  # module.eks.aws_security_group.workers[0] will be created
  + resource "aws_security_group" "workers" {
      + arn                    = (known after apply)
      + description            = "Security group for all nodes in the cluster."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "iac-revenite-dev"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                                   = "iac-revenite-dev-eks_worker_sg"
          + "kubernetes.io/cluster/iac-revenite-dev" = "owned"
        }
      + vpc_id                 = "vpc-04a5b323b7b162cb7"
    }

  # module.eks.aws_security_group_rule.cluster_egress_internet[0] will be created
  + resource "aws_security_group_rule" "cluster_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow cluster egress access to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.cluster_https_worker_ingress[0] will be created
  + resource "aws_security_group_rule" "cluster_https_worker_ingress" {
      + description              = "Allow pods to communicate with the EKS cluster API."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.workers_egress_internet[0] will be created
  + resource "aws_security_group_rule" "workers_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow nodes all egress to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.workers_ingress_cluster[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster" {
      + description              = "Allow workers pods to receive communication from the cluster control plane."
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.workers_ingress_cluster_https[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster_https" {
      + description              = "Allow pods running extension API servers on port 443 to receive communication from cluster control plane."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.workers_ingress_self[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_self" {
      + description              = "Allow node to communicate with each other."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "./kubeconfig_iac-revenite-dev"
      + id                   = (known after apply)
    }

  # module.eks.null_resource.wait_for_cluster[0] will be created
  + resource "null_resource" "wait_for_cluster" {
      + id = (known after apply)
    }

  # module.eks.random_pet.workers[0] will be created
  + resource "random_pet" "workers" {
      + id        = (known after apply)
      + keepers   = (known after apply)
      + length    = 2
      + separator = "-"
    }

  # module.vpc.aws_eip.nat[1] will be destroyed
  - resource "aws_eip" "nat" {
      - association_id       = "eipassoc-0f1bb078b95794899" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-0c5405a2a6e7b22a4" -> null
      - network_border_group = "eu-west-1" -> null
      - network_interface    = "eni-02000ee4f817020ad" -> null
      - private_dns          = "ip-10-0-102-130.eu-west-1.compute.internal" -> null
      - private_ip           = "10.0.102.130" -> null
      - public_dns           = "ec2-54-228-218-82.eu-west-1.compute.amazonaws.com" -> null
      - public_ip            = "54.228.218.82" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Name" = "iac-revenite-dev-eu-west-1b"
        } -> null
      - vpc                  = true -> null
    }

  # module.vpc.aws_eip.nat[2] will be destroyed
  - resource "aws_eip" "nat" {
      - association_id       = "eipassoc-0991b454e12afe8c9" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-079eda0735b8b1c16" -> null
      - network_border_group = "eu-west-1" -> null
      - network_interface    = "eni-0ff9ebda981f97534" -> null
      - private_dns          = "ip-10-0-103-122.eu-west-1.compute.internal" -> null
      - private_ip           = "10.0.103.122" -> null
      - public_dns           = "ec2-52-212-60-196.eu-west-1.compute.amazonaws.com" -> null
      - public_ip            = "52.212.60.196" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Name" = "iac-revenite-dev-eu-west-1c"
        } -> null
      - vpc                  = true -> null
    }

  # module.vpc.aws_nat_gateway.this[1] will be destroyed
  - resource "aws_nat_gateway" "this" {
      - allocation_id        = "eipalloc-0c5405a2a6e7b22a4" -> null
      - id                   = "nat-09bac3e3bd9d1cd7f" -> null
      - network_interface_id = "eni-02000ee4f817020ad" -> null
      - private_ip           = "10.0.102.130" -> null
      - public_ip            = "54.228.218.82" -> null
      - subnet_id            = "subnet-0c2ec0fe8c82dd991" -> null
      - tags                 = {
          - "Name" = "iac-revenite-dev-eu-west-1b"
        } -> null
    }

  # module.vpc.aws_nat_gateway.this[2] will be destroyed
  - resource "aws_nat_gateway" "this" {
      - allocation_id        = "eipalloc-079eda0735b8b1c16" -> null
      - id                   = "nat-01933ef5e62103405" -> null
      - network_interface_id = "eni-0ff9ebda981f97534" -> null
      - private_ip           = "10.0.103.122" -> null
      - public_ip            = "52.212.60.196" -> null
      - subnet_id            = "subnet-0f1bb88d5774fefe3" -> null
      - tags                 = {
          - "Name" = "iac-revenite-dev-eu-west-1c"
        } -> null
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be destroyed
  - resource "aws_route" "private_nat_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-0e896a0c20d2430f81080289494" -> null
      - nat_gateway_id         = "nat-09bac3e3bd9d1cd7f" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0e896a0c20d2430f8" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.aws_route.private_nat_gateway[2] will be destroyed
  - resource "aws_route" "private_nat_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-0e54618954bef6ac81080289494" -> null
      - nat_gateway_id         = "nat-01933ef5e62103405" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0e54618954bef6ac8" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0050d27e0c1a421ce"
        owner_id         = "739509468525"
        propagating_vgws = []
        route            = [
            {
                cidr_block                = "0.0.0.0/0"
                egress_only_gateway_id    = ""
                gateway_id                = ""
                instance_id               = ""
                ipv6_cidr_block           = ""
                local_gateway_id          = ""
                nat_gateway_id            = "nat-00fd283818b47ca49"
                network_interface_id      = ""
                transit_gateway_id        = ""
                vpc_endpoint_id           = ""
                vpc_peering_connection_id = ""
            },
        ]
      ~ tags             = {
          ~ "Name" = "iac-revenite-dev-private-eu-west-1a" -> "iac-revenite-dev-private"
        }
        vpc_id           = "vpc-04a5b323b7b162cb7"
    }

  # module.vpc.aws_route_table.private[1] will be destroyed
  - resource "aws_route_table" "private" {
      - id               = "rtb-0e896a0c20d2430f8" -> null
      - owner_id         = "739509468525" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - cidr_block                = "0.0.0.0/0"
              - egress_only_gateway_id    = ""
              - gateway_id                = ""
              - instance_id               = ""
              - ipv6_cidr_block           = ""
              - local_gateway_id          = ""
              - nat_gateway_id            = "nat-09bac3e3bd9d1cd7f"
              - network_interface_id      = ""
              - transit_gateway_id        = ""
              - vpc_endpoint_id           = ""
              - vpc_peering_connection_id = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "iac-revenite-dev-private-eu-west-1b"
        } -> null
      - vpc_id           = "vpc-04a5b323b7b162cb7" -> null
    }

  # module.vpc.aws_route_table.private[2] will be destroyed
  - resource "aws_route_table" "private" {
      - id               = "rtb-0e54618954bef6ac8" -> null
      - owner_id         = "739509468525" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - cidr_block                = "0.0.0.0/0"
              - egress_only_gateway_id    = ""
              - gateway_id                = ""
              - instance_id               = ""
              - ipv6_cidr_block           = ""
              - local_gateway_id          = ""
              - nat_gateway_id            = "nat-01933ef5e62103405"
              - network_interface_id      = ""
              - transit_gateway_id        = ""
              - vpc_endpoint_id           = ""
              - vpc_peering_connection_id = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "iac-revenite-dev-private-eu-west-1c"
        } -> null
      - vpc_id           = "vpc-04a5b323b7b162cb7" -> null
    }

  # module.vpc.aws_route_table_association.private[1] will be updated in-place
  ~ resource "aws_route_table_association" "private" {
        id             = "rtbassoc-030bf43631e108e6a"
      ~ route_table_id = "rtb-0e896a0c20d2430f8" -> "rtb-0050d27e0c1a421ce"
        subnet_id      = "subnet-01d8ca1ca0683beb6"
    }

  # module.vpc.aws_route_table_association.private[2] will be updated in-place
  ~ resource "aws_route_table_association" "private" {
        id             = "rtbassoc-07811f5e914633db3"
      ~ route_table_id = "rtb-0e54618954bef6ac8" -> "rtb-0050d27e0c1a421ce"
        subnet_id      = "subnet-0e3878cbbe62e3719"
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        arn                             = "arn:aws:ec2:eu-west-1:739509468525:subnet/subnet-0ceb2435a0e0b6a3a"
        assign_ipv6_address_on_creation = false
        availability_zone               = "eu-west-1a"
        availability_zone_id            = "euw1-az3"
        cidr_block                      = "10.0.1.0/24"
        id                              = "subnet-0ceb2435a0e0b6a3a"
        map_public_ip_on_launch         = false
        owner_id                        = "739509468525"
      ~ tags                            = {
            "Name"                                   = "iac-revenite-dev-private-eu-west-1a"
          + "kubernetes.io/cluster/iac-revenite-dev" = "shared"
          + "kubernetes.io/role/internal-elb"        = "1"
        }
        vpc_id                          = "vpc-04a5b323b7b162cb7"
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        arn                             = "arn:aws:ec2:eu-west-1:739509468525:subnet/subnet-01d8ca1ca0683beb6"
        assign_ipv6_address_on_creation = false
        availability_zone               = "eu-west-1b"
        availability_zone_id            = "euw1-az1"
        cidr_block                      = "10.0.2.0/24"
        id                              = "subnet-01d8ca1ca0683beb6"
        map_public_ip_on_launch         = false
        owner_id                        = "739509468525"
      ~ tags                            = {
            "Name"                                   = "iac-revenite-dev-private-eu-west-1b"
          + "kubernetes.io/cluster/iac-revenite-dev" = "shared"
          + "kubernetes.io/role/internal-elb"        = "1"
        }
        vpc_id                          = "vpc-04a5b323b7b162cb7"
    }

  # module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        arn                             = "arn:aws:ec2:eu-west-1:739509468525:subnet/subnet-0e3878cbbe62e3719"
        assign_ipv6_address_on_creation = false
        availability_zone               = "eu-west-1c"
        availability_zone_id            = "euw1-az2"
        cidr_block                      = "10.0.3.0/24"
        id                              = "subnet-0e3878cbbe62e3719"
        map_public_ip_on_launch         = false
        owner_id                        = "739509468525"
      ~ tags                            = {
            "Name"                                   = "iac-revenite-dev-private-eu-west-1c"
          + "kubernetes.io/cluster/iac-revenite-dev" = "shared"
          + "kubernetes.io/role/internal-elb"        = "1"
        }
        vpc_id                          = "vpc-04a5b323b7b162cb7"
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        arn                             = "arn:aws:ec2:eu-west-1:739509468525:subnet/subnet-04a1a3206be60a72b"
        assign_ipv6_address_on_creation = false
        availability_zone               = "eu-west-1a"
        availability_zone_id            = "euw1-az3"
        cidr_block                      = "10.0.101.0/24"
        id                              = "subnet-04a1a3206be60a72b"
        map_public_ip_on_launch         = true
        owner_id                        = "739509468525"
      ~ tags                            = {
            "Name"                                   = "iac-revenite-dev-public-eu-west-1a"
          + "kubernetes.io/cluster/iac-revenite-dev" = "shared"
          + "kubernetes.io/role/elb"                 = "1"
        }
        vpc_id                          = "vpc-04a5b323b7b162cb7"
    }

  # module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        arn                             = "arn:aws:ec2:eu-west-1:739509468525:subnet/subnet-0c2ec0fe8c82dd991"
        assign_ipv6_address_on_creation = false
        availability_zone               = "eu-west-1b"
        availability_zone_id            = "euw1-az1"
        cidr_block                      = "10.0.102.0/24"
        id                              = "subnet-0c2ec0fe8c82dd991"
        map_public_ip_on_launch         = true
        owner_id                        = "739509468525"
      ~ tags                            = {
            "Name"                                   = "iac-revenite-dev-public-eu-west-1b"
          + "kubernetes.io/cluster/iac-revenite-dev" = "shared"
          + "kubernetes.io/role/elb"                 = "1"
        }
        vpc_id                          = "vpc-04a5b323b7b162cb7"
    }

  # module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        arn                             = "arn:aws:ec2:eu-west-1:739509468525:subnet/subnet-0f1bb88d5774fefe3"
        assign_ipv6_address_on_creation = false
        availability_zone               = "eu-west-1c"
        availability_zone_id            = "euw1-az2"
        cidr_block                      = "10.0.103.0/24"
        id                              = "subnet-0f1bb88d5774fefe3"
        map_public_ip_on_launch         = true
        owner_id                        = "739509468525"
      ~ tags                            = {
            "Name"                                   = "iac-revenite-dev-public-eu-west-1c"
          + "kubernetes.io/cluster/iac-revenite-dev" = "shared"
          + "kubernetes.io/role/elb"                 = "1"
        }
        vpc_id                          = "vpc-04a5b323b7b162cb7"
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        arn                              = "arn:aws:ec2:eu-west-1:739509468525:vpc/vpc-04a5b323b7b162cb7"
        assign_generated_ipv6_cidr_block = false
        cidr_block                       = "10.0.0.0/16"
        default_network_acl_id           = "acl-0b428fa39b7a5089a"
        default_route_table_id           = "rtb-0ce83467c00f4bb92"
        default_security_group_id        = "sg-0d452b427f874913a"
        dhcp_options_id                  = "dopt-b5c253d3"
        enable_classiclink               = false
        enable_classiclink_dns_support   = false
      ~ enable_dns_hostnames             = false -> true
        enable_dns_support               = true
        id                               = "vpc-04a5b323b7b162cb7"
        instance_tenancy                 = "default"
        main_route_table_id              = "rtb-0ce83467c00f4bb92"
        owner_id                         = "739509468525"
        tags                             = {
            "Name" = "iac-revenite-dev"
        }
    }

Plan: 27 to add, 10 to change, 8 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @259095, Action: `pull_request`, Working Directory: ``, Workflow: `tests-terraform`*